podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PIN_INT_LPC82x.svd.xml
<!--
Devices using this peripheral: 
      LPC82x
-->
      <peripheral>
         <?sourceFile "PIN_INT_LPC82x" ?>
         <name>PIN_INT</name>
         <description>Pin interrupt and  pattern match engine</description>
         <groupName>GPIO_PIN_INT</groupName>
         <headerStructName>PIN_INT</headerStructName>
         <baseAddress>0xA0004000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x8</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x10</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x14</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1C</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ISEL</name>
               <description>Pin Interrupt Mode register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>PMODE</name>
                     <description>Selects the interrupt mode for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Edge sensitive 1 = Level sensitive</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IENR</name>
               <description>Pin interrupt level or rising edge interrupt enable register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>ENRL</name>
                     <description>Enables the rising edge or level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable rising edge or level interrupt. 1 = Enable rising edge or level interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIENR</name>
               <description>Pin interrupt level (rising edge) interrupt set register</description>
               <addressOffset>0x8</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SETENRL</name>
                     <description>Ones written to this address set bits in the IENR, thus enabling interrupts. Bit n sets bit n in the IENR register. 0 = No operation. 1 = Enable rising edge or level interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIENR</name>
               <description>Pin interrupt level  or rising edge interrupt clear register</description>
               <addressOffset>0xC</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CENRL</name>
                     <description>Ones written to this address clear bits in the IENR, thus disabling the interrupts. Bit n clears bit n in the IENR register. 0 = No operation. 1 = Disable rising edge or level interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IENF</name>
               <description>Pin interrupt active level or falling edge interrupt enable register</description>
               <addressOffset>0x10</addressOffset>
               <fields>
                  <field>
                     <name>ENAF</name>
                     <description>Enables the falling edge or configures the active level interrupt for each pin interrupt. Bit n configures the pin interrupt selected in PINTSELn. 0 = Disable falling edge interrupt or set active interrupt level LOW. 1 = Enable falling edge interrupt enabled or set active interrupt level HIGH</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SIENF</name>
               <description>Pin interrupt active level or falling edge interrupt set register</description>
               <addressOffset>0x14</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SETENAF</name>
                     <description>Ones written to this address set bits in the IENF, thus enabling interrupts. Bit n sets bit n in the IENF register. 0 = No operation. 1 = Select HIGH-active interrupt or enable falling edge interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CIENF</name>
               <description>Pin interrupt active level (falling edge) interrupt clear register</description>
               <addressOffset>0x18</addressOffset>
               <access>write-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>CENAF</name>
                     <description>Ones written to this address clears bits in the IENF, thus disabling interrupts. Bit n clears bit n in the IENF register. 0 = No operation. 1 = LOW-active interrupt selected or falling edge interrupt disabled</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RISE</name>
               <description>Pin interrupt rising edge register</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>RDET</name>
                     <description>Rising edge detect. Bit n detects the rising edge of the pin selected in PINTSELn. Read 0: No rising edge has been detected on this pin since Reset or the last time a one was written to this bit. Write 0: no operation. Read 1: a rising edge has been detected since Reset or the last time a one was written to this bit. Write 1: clear rising edge detection for this pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FALL</name>
               <description>Pin interrupt falling edge register</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>FDET</name>
                     <description>Falling edge detect. Bit n detects the falling edge of the pin selected in PINTSELn. Read 0: No falling edge has been detected on this pin since Reset or the last time a one was written to this bit. Write 0: no operation. Read 1: a falling edge has been detected since Reset or the last time a one was written to this bit. Write 1: clear falling edge detection for this pin</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IST</name>
               <description>Pin interrupt status register</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>PSTAT</name>
                     <description>Pin interrupt status. Bit n returns the status, clears the edge interrupt, or inverts the active level of the pin selected in PINTSELn. Read 0: interrupt is not being requested for this interrupt pin.  Write 0: no operation. Read 1: interrupt is being requested for this interrupt pin. Write 1 (edge-sensitive): clear rising- and falling-edge detection for this pin. Write 1 (level-sensitive): switch the active level for this pin (in the IENF register)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMCTRL</name>
               <description>GPIO pattern match interrupt control register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>SEL_PMATCH</name>
                     <description>Specifies whether the 8 pin interrupts are controlled by the pin interrupt function or by the pattern match function</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>PIN_INTERRUPT_INTER</name>
                           <description>Pin interrupt. Interrupts are driven in response to the standard pin interrupt function</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PATTERN_MATCH_INTER</name>
                           <description>Pattern match. Interrupts are driven in response to pattern matches</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENA_RXEV</name>
                     <description>Enables the RxEv output to the ARM cpu and/or to a GPIO output when the specified boolean expression evaluates to true</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>DISABLED_RXEV_OUTPU</name>
                           <description>Disabled. RxEv output to the cpu is disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED_RXEV_OUTPUT</name>
                           <description>Enabled. RxEv output to the cpu is enabled</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PMAT</name>
                     <description>This field displays the current state of pattern matches. A 1 in any bit of this field indicates that the corresponding product term is matched by the current state of the appropriate inputs</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
