podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PIN_INT_LPC82x.svd.xml
            <register>
               <name>PMSRC</name>
               <description>GPIO pattern match interrupt bit-slice source register</description>
               <addressOffset>0x2C</addressOffset>
               <fields>
                  <field>
                     <name>Reserved</name>
                     <description>Software should not write 1s to unused bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>SRC0</name>
                     <description>Selects the input source for bit slice 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 0</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 0</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 0</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 0</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 0</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 0</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 0</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC1</name>
                     <description>Selects the input source for bit slice 1</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 1</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 1</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 1</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 1</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 1</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 1</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC2</name>
                     <description>Selects the input source for bit slice 2</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 2</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 2</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 2</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 2</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 2</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 2</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 2</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC3</name>
                     <description>Selects the input source for bit slice 3</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 3</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 3</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 3</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 3</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 3</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 3</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC4</name>
                     <description>Selects the input source for bit slice 4</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 4</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 4</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 4</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 4</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 4</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 4</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 4</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC5</name>
                     <description>Selects the input source for bit slice 5</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 5</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 5</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 5</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 5</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 5</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 5</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 5</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC6</name>
                     <description>Selects the input source for bit slice 6</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 6</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 6</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 6</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 6</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 6</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 6</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 6</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRC7</name>
                     <description>Selects the input source for bit slice 7</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>INPUT_0_SELECTS_PIN</name>
                           <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 7</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_1_SELECTS_PIN</name>
                           <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 7</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_2_SELECTS_PIN</name>
                           <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 7</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_3_SELECTS_PIN</name>
                           <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 7</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_4_SELECTS_PIN</name>
                           <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 7</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_5_SELECTS_PIN</name>
                           <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 7</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_6_SELECTS_PIN</name>
                           <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 7</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INPUT_7_SELECTS_PIN</name>
                           <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
