podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/PIN_INT_LPC82x.svd.xml
            <register>
               <name>PMCFG</name>
               <description>GPIO pattern match interrupt bit slice configuration register</description>
               <addressOffset>0x30</addressOffset>
               <fields>
                  <field>
                     <name>PROD_ENDPTS</name>
                     <description>A 1 in any bit of this field causes the corresponding bit slice to be the final component of a product term in the boolean expression.  This has two effects: 1. The interrupt request associated with this bit-slice will be asserted whenever a match to that product term is detected. 2. The next bit slice will start a new, independent product term in the boolean expression (i.e. an OR will be inserted in the boolean expression following the element controlled by this bit slice)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>Reserved</name>
                     <description>(Bit slice 7 is automatically considered a product end point)  Software should not write 1s to unused bits</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFG0</name>
                     <description>Specifies the match-contribution condition for bit slice 0</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>CONSTANT_1_THIS_BIT</name>
                           <description>Constant 1. This bit slice always contributes to a product term match</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_EDGE_MATCH_O</name>
                           <description>Rising edge. Match occurs if a rising edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING_EDGE_MATCH_</name>
                           <description>Falling edge. Match occurs if a falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_OR_FALLING_ED</name>
                           <description>Rising or falling edge. Match occurs if either a rising or falling edge on the specified input has occurred since the last time the edge detection for this bit slice was cleared</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_LEVEL_MATCH_F</name>
                           <description>High level. Match (for this bit slice) occurs when there is a high level on the input specified for this bit slice in the PMSRC register</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW_LEVEL_MATCH_OCC</name>
                           <description>Low level. Match occurs when there is a low level on the specified input</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONSTANT_0_THIS_BIT</name>
                           <description>Constant 0. This bit slice never contributes to a match (should be used to disable any unused bit slices)</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EVENT_MATCH_OCCURS_</name>
                           <description>Event. Match occurs on an event - i.e. when either a rising or falling edge is first detected on the specified input (this is a non-sticky version of option 3)</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="CFG0" > <name>CFG1</name> <description>Specifies the match-contribution condition for bit slice 1</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG2</name> <description>Specifies the match-contribution condition for bit slice 2</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG3</name> <description>Specifies the match-contribution condition for bit slice 3</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG4</name> <description>Specifies the match-contribution condition for bit slice 4</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG5</name> <description>Specifies the match-contribution condition for bit slice 5</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG6</name> <description>Specifies the match-contribution condition for bit slice 6</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="CFG0" > <name>CFG7</name> <description>Specifies the match-contribution condition for bit slice 7</description> <bitOffset>29</bitOffset> </field>
               </fields>
            </register>
         </registers>
      </peripheral>
